baseCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parameters.H"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    walls
   {
        type        porousInterfaceBJS;
        value        uniform (1 0 0);

        alpha       1;
        slipCoeff   uniform $phi;

    }


    inlet
    {
        type            fixedProfile;//fixedValue;
        value           uniform (1 0 0);

        profile         polynomial
        (
//            ((1.5 0 0)        (0 0 0))
//            ((-1.5 0 0)    (2 0 0))

           ((#calc "3./2. - 3.* $phi/(6.*$phi + 2)" 0 0)        (0 0 0)) //-1/2 U_slip + 3/2 U_avg
           ((#calc "(9.*$phi/(6.0*$phi + 2) - 3./2.)" 0 0)         (2 0 0)) // 3/2(U_slip -U_avg)
           ((0 0 #calc "3.*($phi+1)/(3.0*$phi + 1)*$alpha")         ( 0 0 1 )) //
        );
        direction       (0 0 1);
        origin          0;
    }

    outlet
    {
        type            zeroGradient;//pressureInletOutletVelocity;
        value           uniform (0 0 0);

    }


    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
