baseCase/system/sample8
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../parameters.H"
L  20;
z0  #calc "1.0 + L*$alpha";
z1 #calc "-1.0 - L*$alpha";	

type sets;
libs            ("libsampling.so");

interpolationScheme cellPointFace;

setFormat       raw;

sets
(
    data
    {
        type    lineFace;
        axis    z;
        start   ($L 0 $z0);
        end     ($L 0 $z1);
        nPoints 100;
    }
);

fields          (U);

// ************************************************************************* //
